lvx/base/Documents/бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/InformationRegisters/бит_ИсторияИзмененияСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияИзмененияСтатусовОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Comment>Вид статуса</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСтатусовОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРеестре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦФО</Name>
					<Comment>Вид ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяЮрЛицом</Name>
					<Comment>Признак того, что подразделение является юридическим лицом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАктуальности</Name>
					<Comment>Признак актуальности текущего ЦФО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаРегл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/СценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СценарииПланирования</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Периодичность</Name>
					<Comment>Периодичность планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьИнтервала</Name>
					<Comment>Продолжительность интервала планирования (количество периодов планирования)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКонтроля</Name>
					<Comment>Периодичность контроля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКурсыСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольЗаявокПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьКонтрольГрафиковДоговоровПоЛимитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Documents/бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой(ЭтотОбъект);
	 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
			
	// Стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства	
	
	Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений();
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(
									ЭтотОбъект, "ТаблицаПозиции", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	УстановитьОтборПозиций();	
	УстановитьПараметрыВыбораВидаОперации(ЭтотОбъект);
	
	ОтображатьБюджетПриОткрытии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователя",
																					"ОтображатьБюджетПриОткрытии",
																					Ложь);
	Если ОтображатьБюджетПриОткрытии Тогда
		ОтображатьБюджет = Истина;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();	
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойств
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		 И ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ПодключитьОбработчикОжидания("ОжиданиеОткрытияФормы", 0.1, Истина);
	КонецЕсли; 
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если КопироватьПозиции Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗначениеКопирования", ЗначениеКопирования);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборПозиций();
	Элементы.ТаблицаПозиции.Обновить();
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ПараметрПередачи = Новый Структура("Ссылка, Важность, Сумма", Объект.Ссылка
																, Объект.Важность
																, Объект.СуммаДокумента);
	Оповестить("бит_ИзменениеДокументаПеремещениеДС", ПараметрПередачи, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус" Тогда		
		ОбработкаОповещенияИзмененияСтатуса();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	бит_КазначействоКлиент.ОбработкаОповещенияФормыДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	ЦФОПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;

	УправлениеФормой(ЭтотОбъект);
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьЛимитыПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	
	ХозяйственнаяОперацияПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	
	РеквизитыСчета			 = РеквизитыБанковскогоСчета(Объект.БанковскийСчет);
	НеобходимПересчетВВалюту = Ложь;
	
	Если Объект.СуммаДокумента <> 0 Тогда
		НеобходимПересчетВВалюту = ФинансыКлиент.НеобходимПересчетВВалюту(Объект, Объект.ВалютаДокумента, РеквизитыСчета.Валюта);
	КонецЕсли;
	
	Если НЕ НеобходимПересчетВВалюту Тогда
		БанковскийСчетПриИзмененииНаСервере(РеквизитыСчета, Ложь);
		ОтобразитьБюджетСПаузой();
	Иначе
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Пересчитать суммы в документе в валюту %1?';
				|en = 'Convert amounts in the document into currency %1?'"),
			РеквизитыСчета.Валюта);
		
		КнопкиДиалогаВопрос = Новый СписокЗначений;
		КнопкиДиалогаВопрос.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Пересчитать';
																|en = 'Recalculate'"));
		КнопкиДиалогаВопрос.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отменить';
																	|en = 'Cancel'"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РазрешенПересчетВВалютуСчет", 
								ЭтотОбъект, Новый Структура("РеквизитыСчета", РеквизитыСчета));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиДиалогаВопрос);
	КонецЕсли;

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура РазрешенПересчетВВалютуСчет(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТекущаяВалюта = Объект.ВалютаДокумента;
		БанковскийСчетПриИзмененииНаСервере(ДополнительныеПараметры.РеквизитыСчета, Истина);
		ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ТекущаяВалюта, Объект.ВалютаДокумента);
		ОтобразитьБюджетСПаузой();
	Иначе
		Объект.БанковскийСчет = КонтролируемыеРеквизиты.БанковскийСчет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	РеквизитыКассы			 = РеквизитыКассы(Объект.Касса);
	НеобходимПересчетВВалюту = Ложь;
	
	Если Объект.СуммаДокумента <> 0 Тогда
		НеобходимПересчетВВалюту = ФинансыКлиент.НеобходимПересчетВВалюту(Объект, Объект.ВалютаДокумента, РеквизитыКассы.Валюта);
	КонецЕсли;
	
	Если НЕ НеобходимПересчетВВалюту Тогда
		КассаПриИзмененииНаСервере(РеквизитыКассы, Ложь);
		ОтобразитьБюджетСПаузой();
	Иначе
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Пересчитать суммы в документе в валюту %1?';
				|en = 'Convert amounts in the document into currency %1?'"),
			РеквизитыКассы.Валюта);
		
		КнопкиДиалогаВопрос = Новый СписокЗначений;
		КнопкиДиалогаВопрос.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Пересчитать';
																|en = 'Recalculate'"));
		КнопкиДиалогаВопрос.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отменить';
																	|en = 'Cancel'"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РазрешенПересчетВВалютуКасса", ЭтотОбъект, 
			Новый Структура("РеквизитыКассы", РеквизитыКассы));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиДиалогаВопрос);
	КонецЕсли;

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура РазрешенПересчетВВалютуКасса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТекущаяВалюта = Объект.ВалютаДокумента;
		КассаПриИзмененииНаСервере(ДополнительныеПараметры.РеквизитыКассы, Истина);
		ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ТекущаяВалюта, Объект.ВалютаДокумента);
		ОтобразитьБюджетСПаузой();
	Иначе
		Объект.Касса = КонтролируемыеРеквизиты.Касса;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

#Область КонтрольБюджетаИВзаиморасчетов

&НаКлиенте
Процедура ДекорацияОтобразитьБюджетКартинкаНажатие(Элемент)
	
	ОтображатьБюджет = НЕ ОтображатьБюджет;
	УправлениеФормой(ЭтотОбъект);
	ОтобразитьБюжет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтобразитьБюджетНажатие(Элемент)
	
	ОтображатьБюджет = НЕ ОтображатьБюджет;
	УправлениеФормой(ЭтотОбъект);
	ОтобразитьБюжет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтображатьБюджетПриОткрытииНажатие(Элемент)
	
	УстановитьОтображениеБюджетаПриОткрытии(ЭтотОбъект, НЕ ОтображатьБюджетПриОткрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОшибкаРасчетаБюджетаНажатие(Элемент)
	
	Если ПустаяСтрока(ИдентификаторОшибкиРасшифровкиБюджета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторОшибкиРасшифровкиБюджета = "НеУказанаСтатьяОборотов" Тогда
		Возврат;
	ИначеЕсли ИдентификаторОшибкиРасшифровкиБюджета = "НеКонтролировать_Заявки" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.СтатьяОборотов);
		ПараметрыФормы.Вставить("АктивныйЭлементПоУмолчанию", "НеКонтролировать_Заявки");
		ОткрытьФорму("Справочник.бит_СтатьиОборотов.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБюджетСуммаБюджетаПоСтатьеНажатие(Элемент)
	
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаБюджетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСуммаБюджетаБезЗаявкиНажатие(Элемент)
	
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетОстатокБюджетаПоСтатьеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетСуммаИсполненныхЗаявокНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетСуммаСверхЛимитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПозиции

&НаКлиенте
Процедура ТаблицаПозицииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		СтандартнаяОбработка = Ложь;
		ПредложитьЗаписатьДокумент();
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПлатежныйДокумент(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	НовыеДокументы = СоздатьПлатежныйДокументСервер();
	
	Для каждого Документ Из НовыеДокументы Цикл
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Документ));
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область КонтрольБюджета

&НаКлиенте
Процедура ОтобразитьБюджетСПаузой()
	
	ОтключитьОбработчикОжидания("ОтобразитьБюжет");
	ПодключитьОбработчикОжидания("ОтобразитьБюжет", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьБюжет()
	
	Если НЕ ОтображатьБюджет Тогда
		Возврат;
	КонецЕсли;
	
	ОтобразитьБюджетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьБюджетНаСервере()
	
	ВыводитьСведенияОЛимитах = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
								"ВыводитьСведенияОЛимитахДляЗаявки");
	ВывестиСведенияОЛимитах(ВыводитьСведенияОЛимитах);
	
	Если НЕ ВыводитьСведенияОЛимитах Тогда
		ТекстСообщения = НСтр("ru='Вывод сведений о лимитах отключен в настройках пользователя'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ОтображатьБюджет = Ложь;
		Если ОтображатьБюджетПриОткрытии Тогда
			УстановитьОтображениеБюджетаПриОткрытии(ЭтотОбъект, Ложь);	
		КонецЕсли;
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСведенияОЛимитах(ВыводитьСведенияОЛимитах)
	
	Если НЕ ВыводитьСведенияОЛимитах Тогда
		Элементы.ГруппаБюджет.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьВозможностьРасчетаБюджета() Тогда
		Элементы.ДекорацияОшибкаРасчетаБюджета.Видимость = Истина;
		Элементы.ГруппаБюджетШапка.Видимость             = Ложь;
		Элементы.ГруппаБюджетОсновнойРаздел.Видимость    = Ложь;
		Возврат;
	Иначе
		Элементы.ДекорацияОшибкаРасчетаБюджета.Видимость = Ложь;
		Элементы.ГруппаБюджетШапка.Видимость             = Истина;
		Элементы.ГруппаБюджетОсновнойРаздел.Видимость    = Истина;
	КонецЕсли;
	
	ПлатежнаяПозиция = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(ПлатежнаяПозиция.Позиция)
		И НЕ Модифицированность
		И НЕ Объект.Ссылка.Пустая() Тогда
		ПараметрыРасчетаБюджета = Документы.бит_кзн_ПлатежнаяПозиция.ПодготовитьПараметрыПроведения(
									ПлатежнаяПозиция.Позиция, Ложь);
	Иначе
		ПараметрыПлатежнойПозиции = ПараметрыПлатежнойПозицииДляРасчетаБюджета();
		ПараметрыРасчетаБюджета   = Документы.бит_кзн_ПлатежнаяПозиция.ПодготовитьПараметрыПроведения(
										ПараметрыПлатежнойПозиции, Ложь);
	КонецЕсли;
	
	СтрокаОстатка   = Неопределено;
	ПериодыКонтроля = Новый Массив;
	Если ПараметрыРасчетаБюджета.ИсполнениеБюджета.Количество() > 0 Тогда
		СтрокаИсполнения           = ПараметрыРасчетаБюджета.ИсполнениеБюджета[0];
		БюджетСуммаЗаявкиПоСтатье  = СтрокаИсполнения.Сумма;
		
		ИсполнениеБюджетаПоСтатье  = ПараметрыРасчетаБюджета.ИсполнениеБюджета.СкопироватьКолонки();
		ЗаполнитьЗначенияСвойств(ИсполнениеБюджетаПоСтатье.Добавить(), СтрокаИсполнения);
		
		ИнформацияОбОстатках       = бит_КонтрольИсполненияБюджета.ПрогнозИсполненияБюджета(
										ИсполнениеБюджетаПоСтатье,
										ПараметрыРасчетаБюджета.ИсполнениеБюджетаРеквизиты);
		ПериодыКонтроля            = ИнформацияОбОстатках.ПериодыКонтроля;
		ОстаткиКонтрольныхЗначений = ИнформацияОбОстатках.ОстаткиКонтрольныхЗначений;
		Если ОстаткиКонтрольныхЗначений.Количество() > 0 Тогда
			СтрокаОстатка = ОстаткиКонтрольныхЗначений[0];
		КонецЕсли;
	КонецЕсли;
	
	НачалоПериодаКонтроля    = Неопределено;
	ОкончаниеПериодаКонтроля = Неопределено;
	
	Если СтрокаОстатка <> Неопределено Тогда 
		СтрокаОстатка                = ОстаткиКонтрольныхЗначений[0];
		БюджетСуммаБюджетаБезЗаявки  = Макс(СтрокаОстатка.Сумма, 0);
		БюджетСуммаБюджетаПоСтатье   = Макс(СтрокаОстатка.СуммаКонтроль, 0);
		БюджетСуммаИсполненныхЗаявок = Макс(СтрокаОстатка.СуммаИсполнение, 0);
		БюджетСуммаСверхЛимита       = Макс(СтрокаОстатка.СуммаСверхЛимита, 0);
		
		ПрогнозИсполненияБюджета = ИнформацияОбОстатках.ПрогнозИсполненияБюджета;
		Если ПрогнозИсполненияБюджета.Количество() > 0 Тогда  
			БюджетОстатокБюджетаПоСтатье = Макс(ПрогнозИсполненияБюджета[0].СуммаКонОстаток, 0);
		Иначе
			БюджетОстатокБюджетаПоСтатье = Макс(СтрокаОстатка.Сумма, 0);
		КонецЕсли;
		
		Для каждого ЭлементПериода Из ПериодыКонтроля Цикл
			Если СтрокаОстатка.Период >= ЭлементПериода.НачалоПериода
				И СтрокаОстатка.Период <= ЭлементПериода.КонецПериода Тогда
				НачалоПериодаКонтроля    = ЭлементПериода.НачалоПериода;
				ОкончаниеПериодаКонтроля = ЭлементПериода.КонецПериода;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НачалоПериодаКонтроля = Неопределено ИЛИ ОкончаниеПериодаКонтроля = Неопределено Тогда
			ПериодичностьКонтроля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОстатка.Сценарий,
										"ПериодичностьКонтроля");
			ПараметрыПериода      = Перечисления.бит_ПериодичностьПланирования.ПараметрыДатыПоПериодичности(
										СтрокаОстатка.Период, ПериодичностьКонтроля);
			НачалоПериодаКонтроля    = ПараметрыПериода.ДатаНачала;
			ОкончаниеПериодаКонтроля = ПараметрыПериода.ДатаОкончания;
		КонецЕсли;
		ПредставлениеПериодаПрогноза = ПредставлениеПериода(НачалоПериодаКонтроля,
															ОкончаниеПериодаКонтроля);
		ШаблонЗаголовкаБюджета = НСтр("ru='Бюджет на %1:'");
		ЗаголовокБюджета       = СтрШаблон(ШаблонЗаголовкаБюджета, ПредставлениеПериодаПрогноза);
	Иначе
		БюджетСуммаБюджетаБезЗаявки  = 0;
		БюджетСуммаБюджетаПоСтатье   = 0;
		БюджетСуммаИсполненныхЗаявок = 0;
		БюджетОстатокБюджетаПоСтатье = 0;
		БюджетСуммаСверхЛимита       = 0;
		
		ЗаголовокБюджета             = НСтр("ru='Бюджет:'");
	КонецЕсли;
	
	Элементы.ДекорацияЗаголовокСуммаБюджетаПоСтатье.Заголовок = ЗаголовокБюджета;
	Элементы.ДекорацияБюджетСуммаБюджетаПоСтатье.Заголовок    = Формат(БюджетСуммаБюджетаПоСтатье, "ЧДЦ=2; ЧН=");
	Элементы.ДекорацияСуммаБюджетаБезЗаявки.Заголовок         = Формат(БюджетСуммаБюджетаБезЗаявки, "ЧДЦ=2; ЧН=");
	
	ЕстьСвехЛимит = (БюджетСуммаСверхЛимита > 0);
	Элементы.ДекорацияСуммаСверхЛимита.Видимость = ЕстьСвехЛимит;
	Элементы.БюджетСуммаСверхЛимита.Видимость    = ЕстьСвехЛимит;
	
	ПостроитьДиаграммуБюджета();
		
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуБюджета()
	
	ДиаграммаБюджета.Очистить();
	ДиаграммаБюджета.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ДиаграммаБюджета.ОбластьПостроения.ЦветФона  = ЦветаСтиля.бит_ЦветФонаПодсказки;
	ДиаграммаБюджета.АвтоТранспонирование = Ложь;
	ДиаграммаБюджета.Обновление = Ложь;
	
	Точка = ДиаграммаБюджета.УстановитьТочку(Неопределено);
	
	Серия = ДиаграммаБюджета.Серии.Добавить("СуммаЗаявки");
	Серия.Текст      = НСтр("ru='Сумма заявки'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветТочекАлгоритма;
	Серия.Раздвигать = Истина;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаЗаявкиПоСтатье);
	
	Серия            = ДиаграммаБюджета.Серии.Добавить("Исполнено");
	Серия.Текст      = НСтр("ru='Исполнено'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	Серия.Раздвигать = Ложь;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаИсполненныхЗаявок);
	
	Серия            = ДиаграммаБюджета.Серии.Добавить("ОстатокБюджета");
	Серия.Текст      = НСтр("ru='Остаток бюджета'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветЗаголовкаСтатуса;
	Серия.Раздвигать = Ложь;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетОстатокБюджетаПоСтатье);
	
	Если БюджетСуммаСверхЛимита > 0 Тогда
		Серия            = ДиаграммаБюджета.Серии.Добавить("СверхЛимита");
		Серия.Текст      = НСтр("ru='Сверх лимита'");
		Серия.Цвет       = ЦветаСтиля.ЦветОтрицательногоЧисла;
		Серия.Раздвигать = Ложь;
		ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаСверхЛимита);
	КонецЕсли;
	
	ДиаграммаБюджета.АвтоТранспонирование = Истина;
	ДиаграммаБюджета.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьРасчетаБюджета()
	
	ИдентификаторОшибкиРасшифровкиБюджета = "";
	Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = "";
	
	СтатьяОборотов = СтатьяОборотовПоВидуОперации();
	Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
		ИдентификаторОшибкиРасшифровкиБюджета = "НеУказанаСтатьяОборотов";
		Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = НСтр("ru = 'Не удалось определить статью оборотов.'");
		Возврат Ложь;
	КонецЕсли;
	
	НеКонтролировать = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "НеКонтролировать_Заявки");
	Если НеКонтролировать Тогда
		ИдентификаторОшибкиРасшифровкиБюджета = "ОтключенКонтрольПоСтатье";
		Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = НСтр("ru = 'Не ведется контроль по статье.'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОтображениеДекорацииОтображенияБюджетаПриОткрытии(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ОтображатьБюджетПриОткрытии Тогда
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Подсказка = НСтр("ru='Не отображать при открытии'");
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Картинка  = БиблиотекаКартинок.Закрепить;
	Иначе
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Подсказка = НСтр("ru='Отображать при открытии'");
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Картинка  = БиблиотекаКартинок.Открепить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеБюджетаПриОткрытии(Форма, НовоеЗначение)
	
	Форма.ОтображатьБюджетПриОткрытии = НовоеЗначение;
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПользователя",
																"ОтображатьБюджетПриОткрытии",
																НовоеЗначение);
	ОтображениеДекорацииОтображенияБюджетаПриОткрытии(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБюджета()
	
	Отбор = Новый Структура;
	Отбор.Вставить("РежимКонтроля"         , ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.Заявки"));
	Отбор.Вставить("СценарийКонтролируемый", Объект.Сценарий);
	
	Если ЗначениеЗаполнено(Объект.ЦФО) Тогда
		ЗначенияОтбора = Новый СписокЗначений;
		ЗначенияОтбора.Добавить(Объект.ЦФО);
		ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка"));
		Отбор.Вставить("ЦФО", ЗначенияОтбора);
	КонецЕсли;
	
	СтатьяОборотов = СтатьяОборотовПоВидуОперации();
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		ЗначенияОтбора = Новый СписокЗначений;
		ЗначенияОтбора.Добавить(СтатьяОборотов);
		ЗначенияОтбора.Добавить(ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ПустаяСсылка"));
		Отбор.Вставить("СтатьяОборотов", ЗначенияОтбора);
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Отбор",                     Отбор);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии",   Истина);
	ПараметрыОтчета.Вставить("Заголовок",                 НСтр("ru='Контрольные значения бюджета по заявкам'"));
	ДополнитьПараметрыРасшифровкиБюджета(ПараметрыОтчета, Отбор);
	
	ОткрытьФорму("Отчет.бит_КонтрольныеЗначенияБюджета.Форма", ПараметрыОтчета, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПараметрыРасшифровкиБюджета(ПараметрыОтчета, Отбор)
	
	КомпоновщикНастроек = Отчеты.бит_КонтрольныеЗначенияБюджета.Создать().КомпоновщикНастроек;
	Настройки           = КомпоновщикНастроек.Настройки;
	
	ПериодКонтроля   = Новый СтандартныйПериод(НачалоПериодаКонтроля, ОкончаниеПериодаКонтроля);
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ЭлементНастройки.Значение = ПериодКонтроля;
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
									ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
		КонецЕсли;
	КонецЕсли;
	
	ОтборСотрудник = Новый ПолеКомпоновкиДанных("Сотрудник");
	Для каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл
		ИмяПоляОтбора = Строка(ЭлементНастройки.ЛевоеЗначение);
		Если НЕ Отбор.Свойство(ИмяПоляОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеОтбора = Отбор[ИмяПоляОтбора];
		Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
			ЭлементНастройки.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			ЭлементНастройки.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ЭлементНастройки.ПравоеЗначение = ЗначениеОтбора;
		ЭлементНастройки.Использование  = Истина;
		
		Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
			ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
										ЭлементНастройки.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				ПользовательскийПараметр.ВидСравнения   = ЭлементНастройки.ВидСравнения;
				ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение;
				ПользовательскийПараметр.Использование  = ЭлементНастройки.Использование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтчета.Вставить("Вариант",                   Настройки);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПлатежнойПозицииДляРасчетаБюджета()
	
	ПоляИсточника       = Новый Массив;
	КоллекцияРеквизитов = Метаданные.Документы.бит_кзн_ПлатежнаяПозиция.Реквизиты;
	Для каждого РеквизитДокумента Из КоллекцияРеквизитов Цикл
		ПоляИсточника.Добавить(РеквизитДокумента.Имя);
	КонецЦикла;
	ПоляИсточника.Добавить("Ссылка");
	ПоляИсточника.Добавить("Дата");
	ИменаПолей = СтрСоединить(ПоляИсточника, ",");
	ПараметрыПлатежнойПозиции = Новый Структура(ИменаПолей);
	
	ЗаполнитьЗначенияСвойств(ПараметрыПлатежнойПозиции, Объект);
	Если НЕ ЗначениеЗаполнено(ПараметрыПлатежнойПозиции.Сценарий) Тогда
		ПараметрыПлатежнойПозиции.Сценарий = Справочники.СценарииПланирования.ПустаяСсылка();
	КонецЕсли;
	
	ПараметрыПлатежнойПозиции.Вставить("ДокументПланирования",           Объект.Ссылка);
	ПараметрыПлатежнойПозиции.Вставить("ДатаПлан",                       Объект.Дата);
	ПараметрыПлатежнойПозиции.Вставить("СуммаВзаиморасчетов",            Объект.СуммаДокумента);
	ПараметрыПлатежнойПозиции.Вставить("ВалютаВзаиморасчетов",           Объект.ВалютаДокумента);
	ПараметрыПлатежнойПозиции.Вставить("КурсЧислительВзаиморасчетов",    1);
	ПараметрыПлатежнойПозиции.Вставить("КурсЗнаменательВзаиморасчетов",  1);
	ПараметрыПлатежнойПозиции.Вставить("СтатьяОборотов",                 СтатьяОборотовПоВидуОперации());
	ПараметрыПлатежнойПозиции.Вставить("ФормаОплаты",
		Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ФормаОплатыПоВидуОперации(Объект.ХозяйственнаяОперация));
	
	Возврат ПараметрыПлатежнойПозиции;
	
КонецФункции

&НаСервере
Функция СтатьяОборотовПоВидуОперации()
	
	Возврат Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.СтатьяОборотовПоВидуОперации(
				Объект.ХозяйственнаяОперация);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ЗаполнитьКонтролируемыеРеквизиты(Форма)
	
	НаборРеквизитов = Новый Структура;
	НаборРеквизитов.Вставить("ВалютаДокумента");
	НаборРеквизитов.Вставить("ХозяйственнаяОперация");
	
	НаборРеквизитов.Вставить("БанковскийСчет");
	НаборРеквизитов.Вставить("БанковскийСчетПолучатель");
	НаборРеквизитов.Вставить("Касса");
	НаборРеквизитов.Вставить("КассаПолучатель");

	ЗаполнитьЗначенияСвойств(НаборРеквизитов, Форма.Объект);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКонтролируемыеРеквизиты(ИмяРеквизита, Форма)
	
	НаборРеквизитов = Новый Структура;
	Для каждого КлючЗначение Из Форма.КонтролируемыеРеквизиты Цикл
		НаборРеквизитов.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла; 
	НаборРеквизитов.Вставить(ИмяРеквизита, Форма.Объект[ИмяРеквизита]);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);	
	
КонецПроцедуры

//  Процедура обработчик-ожидания открытия формы. 
//
&НаКлиенте
Процедура ОжиданиеОткрытияФормы()
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьКопирование",ЭтотОбъект);
	ТекстВопроса =  НСтр("ru='Выполнить копирование и записать документ?';en='Make a copy and write the document?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Да);
	
КонецПроцедуры // ОжиданиеОткрытияФормы()

&НаКлиенте 
Процедура ВыполнитьКопирование(Ответ, ДополнительныеДанные) Экспорт
	
	КопироватьПозиции = ?(Ответ = КодВозвратаДиалога.Да, Истина, Ложь);
	
	Если КопироватьПозиции Тогда
		Записать();
		КопироватьПозиции = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКопирование

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	
	КэшЗначений.Вставить("ИзмеренияДоп"       , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений" , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить()	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект	 = Форма.Объект;
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.РазблокироватьЭлементы(Форма);
		
	Элементы.ГруппаИнфоПлатежи.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.Позиции.Видимость			 = ЗначениеЗаполнено(Объект.Ссылка);
		
	МожноСоздатьПлатежныйДокумент =
		(Форма.ТипСтатуса = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.Утвержден")
			ИЛИ Форма.ТипСтатуса = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен"));
								
	Элементы.ФормаСоздатьПлатежныйДокумент.Доступность = МожноСоздатьПлатежныйДокумент;
	
	Элементы.СверхБюджета.ЦветТекстаЗаголовка = ?(Объект.СверхБюджета, Форма.ЦветОсобогоТекста, Новый Цвет);
	Элементы.СписатьЛимиты.Видимость		  = Форма.НеУчитыватьСверхБюджета;
	Элементы.СписатьЛимиты.Доступность		  = Объект.СверхБюджета;
	
	Элементы.ГруппаДекорацияПредупреждения.Видимость = Форма.ЗаявкаВключенаВРеестр;
	
	Элементы.БанковскийСчет.Видимость 			= Форма.ИспользованиеРеквизитов.БанковскийСчет;
	Элементы.БанковскийСчетПолучатель.Видимость = Форма.ИспользованиеРеквизитов.БанковскийСчетПолучатель;
	Элементы.Касса.Видимость					= Форма.ИспользованиеРеквизитов.Касса;
	Элементы.КассаПолучатель.Видимость 			= Форма.ИспользованиеРеквизитов.КассаПолучатель;
	
	Если Форма.ОтображатьБюджет Тогда
		Элементы.ДекорацияОтобразитьБюджетКартинка.Картинка     = БиблиотекаКартинок.бит_ПерейтиВниз;
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Видимость = Истина;
		Элементы.ГруппаБюджетИВзаиморасчетыРазделы.Видимость    = Истина;
	Иначе
		Элементы.ДекорацияОтобразитьБюджетКартинка.Картинка     = БиблиотекаКартинок.бит_ПерейтиВправо;
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Видимость = Ложь;
		Элементы.ГруппаБюджетИВзаиморасчетыРазделы.Видимость    = Ложь;
	КонецЕсли;
	ОтображениеДекорацииОтображенияБюджетаПриОткрытии(Форма);
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЗаблокироватьЭлементы(Форма);
	
КонецПроцедуры

//  Процедура устанавливает отбор у динамического списка. 
//
&НаСервере
Процедура УстановитьОтборПозиций()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаПозиции, "ДокументПланирования", 
		Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 

КонецПроцедуры // УстановитьОтборПозиций()

//  Функция создает платежный документ на основании документа перемещения.
//
// Возвращаемое значение:
//  ПлатежныйДокумент - Массив.
//
&НаСервере
Функция СоздатьПлатежныйДокументСервер()
	
	ПараметрыДокумента = бит_Казначейство.НовыеПараметрыСозданияПлатежногоДокумента();
	ПараметрыДокумента.ДокументОснование = Объект.Ссылка;
	ПлатежныйДокумент  = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.СоздатьПлатежныйДокументНаОсновании(ПараметрыДокумента);
	
	Возврат ПлатежныйДокумент;
	
КонецФункции // СоздатьПлатежныйДокументСервер()

&НаСервере
Процедура ЗаполнитьСценарий(ПричинаИзменения)

	СтруктураПараметров = Новый Структура;
	Если ПричинаИзменения = "Организация" Тогда
		
		СтруктураПараметров.Вставить("Организация", Объект.Организация);
		
	ИначеЕсли ПричинаИзменения = "ЦФО" Тогда 	
		
		СтруктураПараметров.Вставить("ЦФО", Объект.ЦФО);
		
	КонецЕсли; 
	
	КонтролироватьЗаявку 	  = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(СтруктураПараметров, Объект.Дата);
	СценарийКонтроляПоБюджету = бит_НастройкиПрограммы.КазначействоСценарийКонтроляПоБюджету(СтруктураПараметров, Объект.Дата);
	
	Если ЗначениеЗаполнено(СценарийКонтроляПоБюджету) И КонтролироватьЗаявку Тогда
		Объект.Сценарий = СценарийКонтроляПоБюджету;
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьПараметрыВыбораВидаОперации(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	НовыеПараметры = Новый Массив; 
	НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ТипДокумента", ТипЗнч(Объект.Ссылка)));
	
	Элементы.ХозяйственнаяОперация.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Ложь)

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ПолучитьФункциональнуюОпцию("бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр") Тогда
			ЗаявкаВключенаВРеестр = бит_Казначейство.ЗаявкаВключенаВРеестр(Объект.Ссылка);
		Иначе
			ЗаявкаВключенаВРеестр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ИспользованиеРеквизитов = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ИспользованиеРеквизитовПоХозяйственнойОперации(Объект.ХозяйственнаяОперация);
	ЦветОсобогоТекста 		= ЦветаСтиля.ЦветОсобогоТекста;
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	УстановитьСостояниеДокумента();
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(Организация, ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Организация", Организация);
	ПараметрыНастройки.Вставить("ЦФО",		   ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(ПараметрыНастройки, 
									Период);
	Возврат НеУчитыватьСверхБюджета;
	
КонецФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	Объект.БанковскийСчет			= Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	Объект.Касса         			= Справочники.Кассы.ПустаяСсылка();
	Объект.БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	Объект.КассаПолучатель          = Справочники.Кассы.ПустаяСсылка();
	
	Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ЗаполнитьРеквизитыДокументаПоХозяйственнойОперации(Объект);
	
	ЗаполнитьСценарий("Организация");
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеФормой(ЭтотОбъект);
	
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЦФОПриИзмененииНаСервере()

	ЗаполнитьСценарий("ЦФО");
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьДокумент()

	Оповещение 	   = Новый ОписаниеОповещения("ПредложитьЗаписатьДокументЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru = 'Документ изменен. Для отражения изменений в связанных позициях необходимо записать документ.'; 
							|en = 'The document has been changed. To reflect changes in related items, you need to write a document.'");

	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьДокументЗавершение(Результат, Дополнительно) Экспорт

	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	

	Попытка
		Записать();		
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки; 

	Если Элементы.ТаблицаПозиции.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Элементы.ТаблицаПозиции.ТекущаяСтрока));
	
КонецПроцедуры

&НаСервере
Процедура ХозяйственнаяОперацияПриИзмененииНаСервере()

	ИспользованиеРеквизитов = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ИспользованиеРеквизитовПоХозяйственнойОперации(Объект.ХозяйственнаяОперация);
	Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ЗаполнитьРеквизитыДокументаПоХозяйственнойОперации(Объект);
	
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура БанковскийСчетПриИзмененииНаСервере(РеквизитыСчета, ПересчитыватьСуммы)
	
	ТекущийБанковскийСчет = Объект.БанковскийСчет;
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		Объект.Организация = РеквизитыСчета.Организация;
	КонецЕсли;
	
	ТекущаяВалюта		   = Объект.ВалютаДокумента;
	Объект.ВалютаДокумента = РеквизитыСчета.Валюта;
	
	Если ПересчитыватьСуммы Тогда
		ПересчетСуммДокументаВВалюту(ТекущаяВалюта);
	КонецЕсли;
	
	Объект.БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	Объект.КассаПолучатель          = Справочники.Кассы.ПустаяСсылка();
	
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииНаСервере(РеквизитыКассы, ПересчитыватьСуммы)
	
	ТекущаяКасса = Объект.Касса;
	
	Если ЗначениеЗаполнено(Объект.Касса) Тогда
		Объект.Организация = РеквизитыКассы.Организация;
	КонецЕсли;
	
	ТекущаяВалюта 		   = Объект.ВалютаДокумента;
	Объект.ВалютаДокумента = РеквизитыКассы.Валюта;
	
	Если ПересчитыватьСуммы Тогда
		ПересчетСуммДокументаВВалюту(ТекущаяВалюта);
	КонецЕсли;
	
	Объект.БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	Объект.КассаПолучатель          = Справочники.Кассы.ПустаяСсылка();
	
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыБанковскогоСчета(Знач БанковскийСчет)
	
	Возврат Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(БанковскийСчет);
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыКассы(Знач Касса)
	
	Возврат Справочники.Кассы.ПолучитьРеквизитыКассы(Касса);
	
КонецФункции

&НаСервере
Процедура ПересчетСуммДокументаВВалюту(ТекущаяВалюта)
	
	ДенежныеСредстваСервер.ПересчетСуммДокументаВВалюту(
		Объект, ТекущаяВалюта, Объект.ВалютаДокумента);
	
КонецПроцедуры

#КонецОбласти
